import {calculateZodiacSign} from "../js/lib.js";

test.each([
    [1, 1, 'Козерог'],
    [25, 12, 'Козерог'],
    [25, 1, 'Водолей'],
    [1, 2, 'Водолей'],
    [25, 2, 'Рыбы'],
    [1, 3, 'Рыбы'],
    [25, 3, 'Овен'],
    [1, 4, 'Овен'],
    [25, 4, 'Телец'],
    [1, 5, 'Телец'],
    [25, 5, 'Близнецы'],
    [1, 6, 'Близнецы'],
    [25, 6, 'Рак'],
    [1, 7, 'Рак'],
    [25, 7, 'Лев'],
    [1, 8, 'Лев'],
    [25, 8, 'Дева'],
    [1, 9, 'Дева'],
    [25, 9, 'Весы'],
    [1, 10, 'Весы'],
    [25, 10, 'Скорпион'],
    [1, 11, 'Скорпион'],
    [25, 11, 'Стрелец'],
    [1, 12, 'Стрелец'],
])(
    'should actual day %i, month %i, zodiac is %s',
    (day, month, expected) => {
        const actual = calculateZodiacSign(day, month);
        expect(actual).toBe(expected);
    }
);